app/controllers/homes_controller.rb

  def create
    user = session[:user]
    user.dimensions.each do |dimension|
      user_rating = UserRating.new
      user_rating.rating = params["#{dimension.name}_rating"].to_i
      user_rating.rating_session = session[:rating_session]
      user_rating.dimension = dimension

      user_rating.save!
---
SELECT * FROM "dimensions" INNER JOIN "dimensions_users" ON "dimensions".id = "dimensions_users".dimension_id WHERE ("dimensions_users".user_id = 1 )
INSERT INTO "rating_sessions" ("reference_number", "created_at", "updated_at", "user_id", "channel") VALUES(7998984, '2009-04-02 23:23:38', '2009-04-02 23:23:38', 1, 'mobile')
INSERT INTO "user_ratings" ("rating", "created_at", "dimension_id", "updated_at", "rating_session_id") VALUES(0, '2009-04-03 07:03:17', 1, '2009-04-03 07:03:17', 13)