app/controllers/homes_controller.rb

  def create
    session[:dimension] = Dimension.find_by_id(params[:selected_dimension_id])
---
SELECT * FROM "dimensions" WHERE ("dimensions"."id" IS NULL) LIMIT 1