app/controllers/logins_controller.rb

SELECT * FROM "users" WHERE (usernumber = 'josh' and password = 'josh') LIMIT 1
---
  def create
    reset_session

    @user = User.find :first, :conditions => [ "usernumber = ? and password = ?", params[:usernumber], params[:password]]