app/controllers/rating_controller.rb

INSERT INTO "user_ratings" ("rating", "reference_number", "created_at", "dimension_id", "updated_at", "situational_data", "user_id", "channel") VALUES(1, NULL, '2009-04-01 05:44:46', NULL, '2009-04-01 05:44:46', NULL, 1, NULL)
---
  def create
    rating = UserRating.new
    rating.rating = params[:selected_rating]
    rating.user = session[:user]
    rating.dimension = session[:dimension]

    rating.channel = 'mobile'
    rating.reference_number = 1000000 + rand(8999999)

    rating.save!