app/controllers/significant_occurences_controller.rb

  def create
    situational_data = session[:rating_session].situational_data
    situational_data.significant_occurences = params['significant_occurences']
    situational_data.save!
---
UPDATE "situational_datas" SET "significant_occurences" = 'adssda' WHERE "id" = 11