app/controllers/situational_data_entry_controller.rb

  def create
    situational_data = SituationalData.new
    situational_data.location = params['location']
    situational_data.accompanying_people = params['accompanying_people']

    user_rating = session[:user_rating]
    user_rating.situational_data = situational_data
    user_rating.save!
---
INSERT INTO "situational_datas" ("location", "user_rating_id", "accompanying_people", "significant_occurences") VALUES('somewhere', NULL, 'someone', NULL)
UPDATE "situational_datas" SET "rating_session_id" = NULL WHERE "id" = 1